In [1]:
#Name:Sharon Suryawanshi 
#Class:TE(B)
#College:Keystone School Of Engineering
#Roll No:40

In [3]:
import pandas as pd
import numpy as np

In [4]:
#create array
num=np.array([34,12,37,67,34,15])

In [5]:
num

array([34, 12, 37, 67, 34, 15])

In [6]:
type(num)

numpy.ndarray

In [7]:
num.dtype

dtype('int32')

In [8]:
num=np.array([34,12,37,67,34,15],dtype=np.int16)

In [9]:
num.dtype

dtype('int16')

In [10]:
num[3]

67

In [11]:
#series
s=pd.Series([45,12,38,75,19,36])

In [12]:
s

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [13]:
type(s)

pandas.core.series.Series

In [14]:
s.dtype

dtype('int64')

In [15]:
s.size

6

In [16]:
s.shape

(6,)

In [17]:
#change index
s=pd.Series([45,12,38,75,19,36])

In [18]:
s

0    45
1    12
2    38
3    75
4    19
5    36
dtype: int64

In [21]:
s[3]

75

In [22]:
r=pd.Series([1,2,3,4,5])
n=pd.Series(["Sharon","John","James","Nissi","Sarah","Grace","Glory"])
m=pd.Series([85.67,73.57,71.56,87.80,67.64])

In [23]:
df=pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [24]:
df

   roll    name  marks
0   1.0  Sharon  85.67
1   2.0    John  73.57
2   3.0   James  71.56
3   4.0   Nissi  87.80
4   5.0   Sarah  67.64
5   NaN   Grace    NaN
6   NaN   Glory    NaN

In [25]:
df.shape

(7, 3)

In [26]:
df.size

21

In [27]:
df.dtypes

roll     float64
name      object
marks    float64
dtype: object

In [28]:
type(df)

pandas.core.frame.DataFrame

In [29]:
#Structured Data Analysis

In [30]:
df=pd.read_csv("student.csv")

In [31]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [32]:
df1=pd.read_csv("student1.csv")

In [33]:
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [34]:
cols=['A','B','C','D','E']

In [35]:
df1=pd.read_csv("student1.csv",names=cols)

In [36]:
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [37]:
df3=pd.read_csv("student3.tsv")

In [38]:
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [39]:
df3=pd.read_csv('student3.tsv',sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [40]:
#Read from link
df2 = pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [41]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [44]:
dfx=pd.read_excel('student.xlsx')

In [45]:
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [46]:
#using the dataframes objects attributes

In [47]:
df.shape

(10, 5)

In [48]:
df.size

50

In [49]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [50]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [51]:
df.ndim

2

In [52]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [53]:
#transpose
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [54]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [55]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [56]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [57]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21